app/Traits/EmployeeSummaryTrait.php

select employee_status, COUNT(*) as total from `employees` where `employees`.`deleted_at` is null group by `employee_status`
---
    public function getEmployeeStatusSummary()
    {
        return Employee::selectRaw('employee_status, COUNT(*) as total')
            ->groupBy('employee_status')
            ->pluck('total', 'employee_status')
            ->toArray();

select education, COUNT(*) as total from `employees` where `employees`.`deleted_at` is null group by `education`
---
    public function getEmployeeEducationSummary()
    {
        return Employee::selectRaw("education, COUNT(*) as total")
            ->groupBy('education')
            ->pluck('total', 'education')
            ->toArray();

select religion, COUNT(*) as total from `employees` where `employees`.`deleted_at` is null group by `religion`
---
    public function getEmployeeReligionSummary()
    {
        $religions = [
            'Unknown',
            'Islam',
            'Christian',
            'Catholic',
            'Hindu',
            'Buddha',
            'Confucianism',
            'Others'
        ];

        return Employee::selectRaw("religion, COUNT(*) as total")
            ->groupBy('religion')
            ->pluck('total', 'religion')
            ->toArray();

select marriage, COUNT(*) as total from `employees` where `employees`.`deleted_at` is null group by `marriage`
---
    public function getEmployeeMaritalStatusSummary()
    {
        return Employee::selectRaw("marriage, COUNT(*) as total")
            ->groupBy('marriage')
            ->pluck('total', 'marriage')
            ->toArray();