app/Traits/EmployeeSummaryTrait.php

select `name` from `employee_status` where `employee_status`.`deleted_at` is null order by `name` asc
select employee_status.name as status_name, COUNT(*) as total from `employees` inner join `employee_status` on `employees`.`employee_status` = `employee_status`.`id` where `employees`.`deleted_at` is null group by `employee_status`.`name` order by `employee_status`.`name` asc
---
    public function getEmployeeStatusSummary()
    {
        $employeeStatus = EmployeeStatus::orderBy('name', 'asc')->pluck('name')->toArray();
        $employeeStatusSummary = Employee::selectRaw('employee_status.name as status_name, COUNT(*) as total')
            ->join('employee_status', 'employees.employee_status', '=', 'employee_status.id')
            ->groupBy('employee_status.name')
            ->orderBy('employee_status.name', 'asc')
            ->pluck('total', 'status_name')
            ->toArray();

select gender, COUNT(*) as total from `employees` where `employees`.`deleted_at` is null group by `gender`
---
    public function getEmployeeGenderSummary()
    {
        return Employee::selectRaw("gender, COUNT(*) as total")
            ->groupBy('gender')
            ->pluck('total', 'gender')
            ->toArray();

select count(*) as aggregate from `employees` where TIMESTAMPDIFF(YEAR, date_birth, '2025-01-04 03:36:19') BETWEEN 46 AND 55 and `employees`.`deleted_at` is null
select education, COUNT(*) as total from `employees` where `employees`.`deleted_at` is null group by `education`
---
    public function getEmployeeEducationSummary()
    {
        $educations = [
            'elementary_school',
            'junior_school',
            'high_school',
            'diploma',
            'bachelor',
            'master',
            'doctorate',
        ];

        $educationSummary = Employee::selectRaw("education, COUNT(*) as total")
            ->groupBy('education')
            ->pluck('total', 'education')
            ->toArray();

select count(*) as aggregate from `employees` where TIMESTAMPDIFF(YEAR, date_birth, '2025-05-05 16:26:09') < 20 and `employees`.`deleted_at` is null
select count(*) as aggregate from `employees` where TIMESTAMPDIFF(YEAR, date_birth, '2025-05-05 16:26:09') BETWEEN 21 AND 25 and `employees`.`deleted_at` is null
select count(*) as aggregate from `employees` where TIMESTAMPDIFF(YEAR, date_birth, '2025-05-05 16:26:09') BETWEEN 25 AND 35 and `employees`.`deleted_at` is null
select count(*) as aggregate from `employees` where TIMESTAMPDIFF(YEAR, date_birth, '2025-05-05 16:26:09') BETWEEN 36 AND 45 and `employees`.`deleted_at` is null
select count(*) as aggregate from `employees` where TIMESTAMPDIFF(YEAR, date_birth, '2025-05-05 16:26:09') BETWEEN 46 AND 55 and `employees`.`deleted_at` is null
select count(*) as aggregate from `employees` where TIMESTAMPDIFF(YEAR, date_birth, '2025-05-05 16:26:09') > 55 and `employees`.`deleted_at` is null
---
    public function getEmployeeAgeRangeSummary()
    {
        $now = Carbon::now();
        return [
            '<20_year' => Employee::whereRaw('TIMESTAMPDIFF(YEAR, date_birth, ?) < ?', [$now, 20])->count(),
            '21_25_year'    => Employee::whereRaw('TIMESTAMPDIFF(YEAR, date_birth, ?) BETWEEN ? AND ?', [$now, 21, 25])->count(),
            '26_35_year'    => Employee::whereRaw('TIMESTAMPDIFF(YEAR, date_birth, ?) BETWEEN ? AND ?', [$now, 25, 35])->count(),
            '36_45_year'    => Employee::whereRaw('TIMESTAMPDIFF(YEAR, date_birth, ?) BETWEEN ? AND ?', [$now, 36, 45])->count(),
            '46_55_year'    => Employee::whereRaw('TIMESTAMPDIFF(YEAR, date_birth, ?) BETWEEN ? AND ?', [$now, 46, 55])->count(),
            '>55_year' => Employee::whereRaw('TIMESTAMPDIFF(YEAR, date_birth, ?) > ?', [$now, 55])->count(),
        ];

select count(*) as aggregate from `employees` where TIMESTAMPDIFF(YEAR, joining_date, '2025-01-04 00:19:52') < 1 and `employees`.`deleted_at` is null
select religion, COUNT(*) as total from `employees` where `employees`.`deleted_at` is null group by `religion` order by `religion` asc
---
    public function getEmployeeReligionSummary()
    {
        // Daftar agama default
        $religions = ['buddha', 'catholic', 'christian', 'hindu', 'islam', 'konghuchu'];

        $religionSummary = Employee::selectRaw("religion, COUNT(*) as total")
            ->groupBy('religion')
            ->orderBy('religion', 'asc')
            ->pluck('total', 'religion')
            ->toArray();

select count(*) as aggregate from `employees` where TIMESTAMPDIFF(YEAR, joining_date, '2025-01-04 03:36:19') BETWEEN 7 AND 9 and `employees`.`deleted_at` is null
select marriage, COUNT(*) as total from `employees` where `employees`.`deleted_at` is null group by `marriage` order by `marriage` asc
---
    public function getEmployeeMaritalStatusSummary()
    {
        $marriage = ['single', 'married', 'widowed'];
        $marriageSummary = Employee::selectRaw("marriage, COUNT(*) as total")
            ->groupBy('marriage')
            ->orderBy('marriage', 'asc')
            ->pluck('total', 'marriage')
            ->toArray();

select count(*) as aggregate from `employees` where TIMESTAMPDIFF(YEAR, joining_date, '2025-05-05 16:26:09') < 1 and `employees`.`deleted_at` is null
select count(*) as aggregate from `employees` where TIMESTAMPDIFF(YEAR, joining_date, '2025-05-05 16:26:09') BETWEEN 1 AND 3 and `employees`.`deleted_at` is null
select count(*) as aggregate from `employees` where TIMESTAMPDIFF(YEAR, joining_date, '2025-05-05 16:26:09') BETWEEN 4 AND 6 and `employees`.`deleted_at` is null
select count(*) as aggregate from `employees` where TIMESTAMPDIFF(YEAR, joining_date, '2025-05-05 16:26:09') BETWEEN 7 AND 9 and `employees`.`deleted_at` is null
select count(*) as aggregate from `employees` where TIMESTAMPDIFF(YEAR, joining_date, '2025-05-05 16:26:09') > 9 and `employees`.`deleted_at` is null
---
    public function getEmployeeWorkDurationSummary()
    {
        $now = Carbon::now();

        return [
            '<1_years' => Employee::whereRaw('TIMESTAMPDIFF(YEAR, joining_date, ?) < ?', [$now, 1])->count(),
            '1_3_years'    => Employee::whereRaw('TIMESTAMPDIFF(YEAR, joining_date, ?) BETWEEN ? AND ?', [$now, 1, 3])->count(),
            '4_6_years'   => Employee::whereRaw('TIMESTAMPDIFF(YEAR, joining_date, ?) BETWEEN ? AND ?', [$now, 4, 6])->count(),
            '7_9_years'  => Employee::whereRaw('TIMESTAMPDIFF(YEAR, joining_date, ?) BETWEEN ? AND ?', [$now, 7, 9])->count(),
            '>9_years' => Employee::whereRaw('TIMESTAMPDIFF(YEAR, joining_date, ?) > ?', [$now, 9])->count(),
        ];