app/Traits/FinalGradeTrait.php

    public function getEmployeesWithFinalGrade($selectedMonth, $selectedYear)
    {
        $userDivision = Auth::user()->division_id;
        $userDepartment = Auth::user()->department_id;

        $query = Employee::query();
        $query->whereNull('resignation');

        if ($userDivision && !$userDepartment) {
            $query->where('division_id', $userDivision);
        } elseif (!$userDivision && $userDepartment) {
            $query->where('department_id', $userDepartment);
        }

        $employees = $query->with([
            'GradePas' => function($query) use ($selectedMonth, $selectedYear) {
                $query->select('employee_id', 'month', 'year', DB::raw('avg(grade) as final_pa'))
                    ->where('month', $selectedMonth)
                    ->where('year', $selectedYear)
                    ->groupBy('employee_id', 'month', 'year');
            },
            'GradeKpis' => function($query) use ($selectedMonth, $selectedYear) {
                $query->select('employee_id', 'month', 'year', DB::raw('sum(grade) as final_kpi'))
                    ->where('month', $selectedMonth)
                    ->where('year', $selectedYear)
                    ->groupBy('employee_id', 'month', 'year');
            }
        ])->get();
---
select `employee_id`, `month`, `year`, avg(grade) as final_pa from `grade_pas` where `grade_pas`.`employee_id` in (1, 2, 3, 5, 8, 10, 11, 12, 14, 16, 17, 18, 19, 20, 21, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 38, 39, 40, 44, 45, 50, 51, 60, 66, 70, 72, 74, 75, 76, 77, 78, 80, 83, 90, 103, 106, 107, 108, 109, 110, 111, 112, 117, 118, 120, 122, 125, 126, 129, 133, 134, 135, 136, 137, 138, 139, 143, 144, 147, 149, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170) and `month` = 'January' and `year` = '2025' and `grade_pas`.`deleted_at` is null group by `employee_id`, `month`, `year`
select `employee_id`, `month`, `year`, sum(grade) as final_kpi from `grade_kpis` where `grade_kpis`.`employee_id` in (1, 2, 3, 5, 8, 10, 11, 12, 14, 16, 17, 18, 19, 20, 21, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 38, 39, 40, 44, 45, 50, 51, 60, 66, 70, 72, 74, 75, 76, 77, 78, 80, 83, 90, 103, 106, 107, 108, 109, 110, 111, 112, 117, 118, 120, 122, 125, 126, 129, 133, 134, 135, 136, 137, 138, 139, 143, 144, 147, 149, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170) and `month` = 'January' and `year` = '2025' and `grade_kpis`.`deleted_at` is null group by `employee_id`, `month`, `year`