app/Traits/FinalGradeTrait.php

    public function getEmployeesWithFinalGrade($selectedMonth, $selectedYear): Collection
    {
        $user = Auth::user();

        // 1. Ensure month is numeric if the database stores it as an integer/numeric string
        // This prevents "Not Found" issues if 'January' is passed instead of '1'
        if (!is_numeric($selectedMonth)) {
            $selectedMonth = date('n', strtotime($selectedMonth));
        }

        return Employee::query()
            ->whereNull('resignation')
---
select * from `employees` where `resignation` is null and `employees`.`deleted_at` is null