app/Traits/PresenceSummaryTrait.php

private function calculatePresenceSummary($employees, $startDate, $endDate)
{
    $countStartDate = $startDate ? Carbon::parse($startDate) : Carbon::now()->startOfMonth();
    $countEndDate = $endDate ? Carbon::parse($endDate) : Carbon::now();

    $employees->each(function ($employee) use ($countStartDate, $countEndDate) {
        $totalDays = intval($countStartDate->diffInDays($countEndDate) + 1);

        // Work Day Calculations
        $wd = $employee->workDay;
        $wdName = $wd->pluck('name')->first();
        $dayOff = WorkDay::where('name', $wdName)->where('day_off', 1)->pluck('day');
---
select `day` from `work_days` where `name` = 'ceko' and `day_off` = 1 and `work_days`.`deleted_at` is null

        $employee->absence = intval($effectiveDays - $employee->presence);

        // Overtime
        $employee->total_overtime = Overtime::where('employee_id', $employee->id)
            ->where('status', 1)
            ->whereBetween('date', [$countStartDate, $countEndDate])
            ->sum('total');

        // Late Check-in and Early Check-out
        $employee->late_check_in = Presence::where('employee_id', $employee->id)
            ->whereBetween('date', [$countStartDate, $countEndDate])
            ->sum('late_check_in');
        $employee->check_out_early = Presence::where('employee_id', $employee->id)
            ->whereBetween('date', [$countStartDate, $countEndDate])
            ->sum('check_out_early');

        // Late Arrival
        $employee->late_arrival = Presence::where('employee_id', $employee->id)
            ->whereBetween('date', [$countStartDate, $countEndDate])
            ->where('late_arrival', 1)
            ->count();
---
select sum(`total`) as aggregate from `overtimes` where `employee_id` = 1 and `status` = 1 and `date` between '2025-03-01 00:00:00' and '2025-03-11 11:33:27' and `overtimes`.`deleted_at` is null
select sum(`late_check_in`) as aggregate from `presences` where `employee_id` = 1 and `date` between '2025-03-01 00:00:00' and '2025-03-11 11:33:27' and `presences`.`deleted_at` is null
select sum(`check_out_early`) as aggregate from `presences` where `employee_id` = 1 and `date` between '2025-03-01 00:00:00' and '2025-03-11 11:33:27' and `presences`.`deleted_at` is null
select count(*) as aggregate from `presences` where `employee_id` = 1 and `date` between '2025-03-01 00:00:00' and '2025-03-11 11:33:27' and `late_arrival` = 1 and `presences`.`deleted_at` is null

            ->count();

        //Holiday
        $employee->holiday = Holiday::whereBetween('date', [$countStartDate, $countEndDate])
            ->count('date');
---
select count(`date`) as aggregate from `holidays` where `date` between '2025-03-01 00:00:00' and '2025-03-11 11:33:27' and `holidays`.`deleted_at` is null