app/Traits/PresenceSummaryTrait.php

                                                ->count();

            // ----- Leaves -----
            $employee->annual_leave     = $this->countLeave($employee->id, PRESENCE::LEAVE_ANNUAL, $countStartDate, $countEndDate);
---
select count(`date`) as aggregate from `presences` where `employee_id` = 1 and `leave` is null and `date` between '2025-03-01 00:00:00' and '2025-03-11 11:33:27' and `presences`.`deleted_at` is null

    private function countLeave($employeeId, $leaveType, $start, $end)
    {
        return Presence::where('employee_id', $employeeId)
                    ->where('leave', $leaveType)
                    ->where('leave_status', 1)
                    ->whereBetween('date', [$start, $end])
                    ->count();
---
select count(*) as aggregate from `presences` where `employee_id` = 1 and `leave` = 'half day permit' and `leave_status` = 1 and `date` between '2025-03-01 00:00:00' and '2025-03-11 11:33:27' and `presences`.`deleted_at` is null