app/Http/Controllers/AppraisalController.php

function index(Request $request){
        $employees = Employee::get();
        $appraisals = PerformanceAppraisal::get();
        $selectedMonth = $request->input('month', date('F'));
        $selectedYear = $request->input('year', date('Y'));

        $gradePa = GradePa::with('employees')
            ->select('employee_id', 'month', 'year')
            ->where('month', $selectedMonth)
            ->where('year', $selectedYear)
            ->groupBy('employee_id', 'month', 'year')
            ->get();

            $averageGrades = GradePa::select('employee_id', DB::raw('AVG(grade) as average_grade'))
            ->where('month', $selectedMonth)
            ->where('year', $selectedYear)
            ->groupBy('employee_id')
            ->get();

        $avgGrade = $gradePa->groupBy('employee_id')->map(function($group){
            return $group->avg('grade');
        });

        $finalGrade = $gradePa->groupBy(['employee_id'])->map(function ($group) {
                return $group->avg('grade');
            });
---
select * from `performance_appraisals` where `performance_appraisals`.`deleted_at` is null
select * from `employees` where `employees`.`id` in (1, 3) and `employees`.`deleted_at` is null
select `employee_id`, `month`, `year` from `grade_pas` where `month` = 'January' and `year` = '2025' and `grade_pas`.`deleted_at` is null group by `employee_id`, `month`, `year`

public function create(Request $request){
    $appraisals = PerformanceAppraisal::get();
    $request->validate([
        'employee_id' => 'required|exists:employees,id',
        'month' => 'required',
        'year' => 'required',
        'grades' => 'nullable|array',
        'grades.*' => 'integer|min:0|max:100',
    ]);

    $employee_id = $request->employee_id;
    $employee = Employee::where('id', $employee_id)->first();
    $employee_name = $employee->name;
    $month = $request->month;
    $year = $request->year;

    $existingPa = GradePa::where('employee_id', $employee_id)
                  ->where('month', $month)
                  ->where('year', $year)
                  ->first();
---
select * from `performance_appraisals` where `performance_appraisals`.`deleted_at` is null
select * from `employees` where `id` = '3' and `employees`.`deleted_at` is null limit 1
select * from `grade_pas` where `employee_id` = '3' and `month` = 'January' and `year` = '2025' and `grade_pas`.`deleted_at` is null limit 1

        $gradePa->year = $request->year;
        $gradePa->appraisal_id = $appraisalId;
        $gradePa->grade = $grade;
        $gradePa->save();
---
insert into `grade_pas` (`employee_id`, `month`, `year`, `appraisal_id`, `grade`, `updated_at`, `created_at`) values ('3', 'January', '2025', 43, '17', '2025-01-03 14:35:35', '2025-01-03 14:35:35')

public function detail($employee_id, $month = null, $year = null){
    $employees = Employee::findOrFail($employee_id);
    $appraisals = PerformanceAppraisal::get();
---
select * from `performance_appraisals` where `performance_appraisals`.`deleted_at` is null

public function edit($employee_id, $month = null, $year = null){
    $employees = Employee::findOrFail($employee_id);
    $query = GradePa::where('employee_id', $employee_id);
    if ($month) {
        $query->where('month', $month);
    }
    if ($year) {
        $query->where('year', $year);
    }
    $gradePas = $query->get();
---
select * from `employees` where `employees`.`id` = '1' and `employees`.`deleted_at` is null limit 1
select * from `grade_pas` where `employee_id` = '1' and `month` = 'January' and `year` = '2025' and `grade_pas`.`deleted_at` is null