app/Http/Controllers/AuthController.php

select * from `users` where `username` = 'administrator' and `users`.`deleted_at` is null limit 1
---
        'password' => $password,
    ];

    $admin = User::where('username', $username)->first();