app/Http/Controllers/EmployeeController.php

select * from `employees`
select * from `job_titles` where `job_titles`.`id` in (1, 2, 3, 5)
select * from `positions` where `positions`.`id` in (2, 6, 7, 8, 9, 10, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 36, 37, 38, 39, 40, 41, 44, 45, 46, 47, 49, 50, 51, 52)
---
    function employeelist(){
        $employee = Employee::with('job_title', 'position')->get();

select MIN(id) as id, `name` from `work_days` where `work_days`.`deleted_at` is null group by `name`
select * from `employee_status` where `employee_status`.`deleted_at` is null
select `work_days`.*, `employee_work_day`.`employee_id` as `pivot_employee_id`, `employee_work_day`.`work_day_id` as `pivot_work_day_id` from `work_days` inner join `employee_work_day` on `work_days`.`id` = `employee_work_day`.`work_day_id` where `employee_work_day`.`employee_id` in (214) and `work_days`.`deleted_at` is null
select * from `office_locations` where `office_locations`.`deleted_at` is null
---
    function submit(Request $request){

        $validator = Validator::make($request->all(), [
            'email' => 'required|email',
            'name' => 'required',
            'city' => 'required',
            'domicile' => 'required',
            'place_birth' => 'required',
            'date_birth' => 'required|date',
            'blood_type' => 'required',
            'gender' => 'required',
            'religion' => 'required',
            'marriage' => 'required',
            'education' => 'required',
            'whatsapp' => 'required|regex:/^[0-9]+$/',
            'bank' => 'required',
            'bank_number' => 'required|numeric',
            'position_id' => 'required|integer',
            'job_title_id' => 'required|integer',
            'joining_date' => 'required|date',
            'employee_status' => 'required',
            'sales_status' => 'required',
            'workDay' => 'required|array|min:1',
            'officeLocations' => 'required|array|min:1'

select * from `job_titles` where `job_titles`.`id` = '2' limit 1
select max(`id`) as aggregate from `employees`
---
            ], 422);
        }

        $section = JobTitle::find($request->job_title_id);
        $id = Employee::max('id') + 1;

select * from `employees` where `employees`.`id` = '3' limit 1
select * from `job_titles` where `job_titles`.`id` in (1)
select * from `positions` where `positions`.`id` in (6)
select `work_days`.*, `employee_work_day`.`employee_id` as `pivot_employee_id`, `employee_work_day`.`work_day_id` as `pivot_work_day_id` from `work_days` inner join `employee_work_day` on `work_days`.`id` = `employee_work_day`.`work_day_id` where `employee_work_day`.`employee_id` in (3)
select sum(`total`) as aggregate from `overtimes` where `employee_id` = 1003
---
    public function detail($id){
        $employee = Employee::with('job_title', 'position', 'workDay', 'kpis')->findOrFail($id);

        $startDate = new DateTime($employee->joining_date);
        $currentDate = new DateTime();
        $interval = $startDate->diff($currentDate);

        $years = $interval->y;
        $months = $interval->m;
        $days = $interval->d;

        $totalOvertime = Overtime::where('employee_id', $employee->eid)
        ->sum('total');

select * from `employees` where `employees`.`id` = '1' limit 1
select * from `positions`
select * from `job_titles`
select * from `divisions`
select * from `departments`
select MIN(id) as id, `name` from `work_days` group by `name`
select * from `office_locations`
select * from `performance_appraisal_name`
select * from `employee_status`
---
    public function edit($id){
        $employee = Employee::findOrFail($id);
        $position = Position::all();
        $job_title = JobTitle::all();
        $division = Division::all();
        $department = Department::all();
        $workDay = WorkDay::select(DB::raw('MIN(id) as id'), 'name')
        ->groupBy('name')
        ->get();
        $officeLocations = OfficeLocation::all();
        $pa_id = AppraisalName::all();
        $kpi_id = KpiAspect::all();
        $status = EmployeeStatus::all();

select * from `job_titles` where `job_titles`.`id` = '5' limit 1
select * from `employees` where `employees`.`id` = '1' limit 1
---
    public function update(Request $request, $id){
        $section = JobTitle::find($request->job_title_id);
        $formattedId = str_pad($id, 3, '0', STR_PAD_LEFT);
        $eid = $section->section . $formattedId;

        //find employeeId
        $employee = Employee::findOrFail($id);