app/Http/Controllers/EmployeeAppController.php

    public function index(){
        $employeeId = Auth::id();
        $employee = Employee::with('workDay')->findOrFail($employeeId);
        $workDay = $employee->workDay;

        $today = Carbon::today()->toDateString();
        $presenceToday = Presence::where('employee_id', $employeeId)
            ->whereDate('date', $today)
            ->whereNull('leave_status')
            ->first();

        $leaveAccepted = Presence::where('employee_id', $employeeId)
            ->where('date', $today)
            ->where('leave_status', 1)
            ->first();

        $pastPresence = Presence::where('employee_id', $employeeId)
            ->orderBy('date', 'desc')
            ->whereNull('leave_status')
            ->first();

        $overtimeToday = Overtime::where('employee_id', $employeeId)
            ->whereDate('date', $today)
            ->first();
---
select * from `employees` where `employees`.`id` = 1 and `employees`.`deleted_at` is null limit 1
select `work_days`.*, `employee_work_day`.`employee_id` as `pivot_employee_id`, `employee_work_day`.`work_day_id` as `pivot_work_day_id` from `work_days` inner join `employee_work_day` on `work_days`.`id` = `employee_work_day`.`work_day_id` where `employee_work_day`.`employee_id` in (1) and `work_days`.`deleted_at` is null
select * from `presences` where `employee_id` = 1 and date(`date`) = '2025-03-11' and `leave_status` is null and `presences`.`deleted_at` is null limit 1
select * from `presences` where `employee_id` = 1 and `date` = '2025-03-11' and `leave_status` = 1 and `presences`.`deleted_at` is null limit 1
select * from `presences` where `employee_id` = 1 and `leave_status` is null and `presences`.`deleted_at` is null order by `date` desc limit 1
select * from `overtimes` where `employee_id` = 1 and date(`date`) = '2025-03-11' and `overtimes`.`deleted_at` is null limit 1