app/Http/Controllers/EmployeePositionChangeController.php

    public function index () {
        $positionChange = EmployeePositionChange::with('employees')->get();
        $employees = Employee::with('position')->whereNull('resignation')->get();
        $category = [
            'mutation',
            'promotion',
            'demotion'
        ];
        $positions = Position::get();
---
select * from `employee_position_changes` where `employee_position_changes`.`deleted_at` is null
select * from `employees` where `employees`.`id` in (3, 5, 8, 10, 11, 14, 25, 27) and `employees`.`deleted_at` is null
select * from `employees` where `resignation` is null and `employees`.`deleted_at` is null
select * from `positions` where `positions`.`id` in (4, 5, 6, 7, 8, 10, 11, 12, 13, 14, 15, 16, 18, 20, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 37, 38, 39, 40, 41, 44, 45, 46, 47, 49, 50, 51, 52) and `positions`.`deleted_at` is null
select * from `positions` where `positions`.`deleted_at` is null

    public function store(Request $request) {
        $request->validate([
            'employee_id' => 'required|exists:employees,id',
            // 'oldPosition' => 'required',
            'newPosition' => 'required|different:oldPosition',
            'date' => 'required|date',
            'note' => 'required',
        ]);

        $employee = Employee::find($request->employee_id);
        $oldPosition = $employee->position_id;
        $newPosition = $request->newPosition;

        if($oldPosition == $newPosition) {
            return response()->json([
                'success' => false,
                'message' => 'The same position cannot be changed',
            ]);
        } else {
            EmployeePositionChange::updateOrCreate(
                ['id' => $request->id],
                [
                    'employee_id' => $request->employee_id,
                    'old_position' => $oldPosition,
                    'new_position' => $newPosition,
                    'effective_date' => $request->date,
                    'reason' => $request->note,
                    'category' => $request->category,
                ]
            );

            // Update employee position
            $employee->update([
                'position_id' => $newPosition,
            ]);
---
select * from `employees` where `employees`.`id` = '17' and `employees`.`deleted_at` is null limit 1
select * from `employee_position_changes` where `employee_id` = '8' and `deleted_at` is null and `employee_position_changes`.`deleted_at` is null order by `effective_date` desc
update `employees` set `position_id` = '18', `employees`.`updated_at` = '2024-12-31 17:02:17' where `id` = 17

    public function delete($id){
        $data = EmployeePositionChange::find($id);
        $employee = Employee::find($data->employee_id);
        $oldPosition = $data->old_position;
        $employee->update([
            'position_id' => $oldPosition
        ]);

        $data->delete();
---
select * from `employee_position_changes` where `employee_position_changes`.`id` = '29' and `employee_position_changes`.`deleted_at` is null limit 1
select * from `employees` where `employees`.`id` = 27 and `employees`.`deleted_at` is null limit 1
update `employees` set `position_id` = '3', `employees`.`updated_at` = '2024-12-31 15:12:56' where `id` = 8
update `employee_position_changes` set `deleted_at` = '2025-01-02 11:02:39', `employee_position_changes`.`updated_at` = '2025-01-02 11:02:39' where `id` = 29