app/Http/Controllers/EmployeeController.php

select * from `employees` where `employees`.`id` = '209' and `employees`.`deleted_at` is null limit 1
select * from `positions` where `positions`.`id` in (32) and `positions`.`deleted_at` is null
select `work_days`.*, `employee_work_day`.`employee_id` as `pivot_employee_id`, `employee_work_day`.`work_day_id` as `pivot_work_day_id` from `work_days` inner join `employee_work_day` on `work_days`.`id` = `employee_work_day`.`work_day_id` where `employee_work_day`.`employee_id` in (209) and `work_days`.`deleted_at` is null
select `work_days`.*, `employee_work_day`.`employee_id` as `pivot_employee_id`, `employee_work_day`.`work_day_id` as `pivot_work_day_id` from `work_days` inner join `employee_work_day` on `work_days`.`id` = `employee_work_day`.`work_day_id` where `employee_work_day`.`employee_id` in (214) and `work_days`.`deleted_at` is null
select sum(`total`) as aggregate from `overtimes` where `employee_id` = 5039 and `overtimes`.`deleted_at` is null
---
    public function detail($id)
    {
        $employee = Employee::with('job_title', 'position', 'workDay', 'kpis', 'positionChange.position', 'positionChange.oldPosition')->findOrFail($id);
        $presences = Presence::where('employee_id', $id)
            ->whereNotNull('leave')
            ->get();
        $careers = $employee->positionChange()->orderBy('effective_date', 'desc')->get();

        $startDate = new DateTime($employee->joining_date);
        $dateBirth = new DateTime($employee->date_birth);
        $currentDate = new DateTime();
        $yo = $startDate->diff($currentDate);
        $joining_date = $startDate->diff($currentDate);

        $years = $joining_date->y;
        $months = $joining_date->m;
        $days = $joining_date->d;

        $totalOvertime = Overtime::where('employee_id', $employee->eid)
            ->sum('total');

select * from `job_titles` where `job_titles`.`id` = '2' and `job_titles`.`deleted_at` is null limit 1
select * from `employees` where `employees`.`id` = '214' and `employees`.`deleted_at` is null limit 1
select max(`id`) as aggregate from `employees` where `employees`.`deleted_at` is null
select * from `positions` where `positions`.`id` in (32) and `positions`.`deleted_at` is null
---
    public function submit(EmployeeRequest $request)
    {
        $data = $request->validated();
        $position = Position::with('job_title')->findOrFail($data['position_id']);
        $section = $position->job_title->section ?? 'XXX';

        $isUpdate = isset($data['id']) && Employee::find($data['id']);

        if (!$isUpdate) {
            $id = Employee::max('id') + 1;
            $position = Position::with('job_title')->find($request->position_id);

select * from `employees` where `employees`.`id` = '1' and `employees`.`deleted_at` is null limit 1
---
    public function resetUsernamePassword(Request $request, $id)
    {
        $validator = Validator::make($request->all(), [
            'username' => 'required|string|regex:/^\S*$/|unique:employees,username',
        ]);

        if ($validator->fails()) {
            return response()->json([
                'success' => false,
                'errors' => $validator->errors()
            ], 422);
        }

        $username = $request->username;
        $password = $request->password;
        $employee = Employee::find($id);