app/Http/Controllers/EmployeeController.php

select * from `employees` where `resignation` is null and `employees`.`deleted_at` is null
---
    function employeelist(){
        $employee = Employee::whereNull('resignation')->get();

select * from `positions` where `positions`.`deleted_at` is null
select * from `job_titles` where `job_titles`.`deleted_at` is null
select * from `divisions` where `divisions`.`deleted_at` is null
select * from `departments` where `departments`.`deleted_at` is null
select * from `performance_appraisal_name` where `performance_appraisal_name`.`deleted_at` is null
---
    function create(){
        $position = Position::all();
        $job_title = JobTitle::all();
        $division = Division::all();
        $department = Department::all();
        $workDay = WorkDay::select(DB::raw('MIN(id) as id'), 'name')
            ->groupBy('name')
            ->get();
        $officeLocations = OfficeLocation::all();
        $pa_id = AppraisalName::all();

select MIN(id) as id, `name` from `work_days` where `work_days`.`deleted_at` is null group by `name`
select * from `employee_status` where `employee_status`.`deleted_at` is null
select * from `office_locations` where `office_locations`.`deleted_at` is null
---
    function submit(Request $request){

        $validator = Validator::make($request->all(), [
            'email' => 'required|email',
            'name' => 'required',
            'city' => 'required',
            'domicile' => 'required',
            'place_birth' => 'required',
            'date_birth' => 'required|date',
            'blood_type' => 'required',
            'gender' => 'required',
            'religion' => 'required',
            'marriage' => 'required',
            'education' => 'required',
            'whatsapp' => 'required|regex:/^[0-9]+$/',
            'bank' => 'required',
            'bank_number' => 'required|numeric',
            'position_id' => 'required|integer',
            'job_title_id' => 'required|integer',
            'joining_date' => 'required|date',
            'employee_status' => 'required',
            'sales_status' => 'required',
            'workDay' => 'required|array|min:1',
            'officeLocations' => 'required|array|min:1'

select * from `job_titles` where `job_titles`.`id` in (5) and `job_titles`.`deleted_at` is null
---
            ], 422);
        }

        $section = JobTitle::find($request->job_title_id);

select * from `employees` where `employees`.`id` = '14' and `employees`.`deleted_at` is null limit 1
select * from `job_titles` where `job_titles`.`id` in (3) and `job_titles`.`deleted_at` is null
select * from `positions` where `positions`.`id` in (4) and `positions`.`deleted_at` is null
select `work_days`.*, `employee_work_day`.`employee_id` as `pivot_employee_id`, `employee_work_day`.`work_day_id` as `pivot_work_day_id` from `work_days` inner join `employee_work_day` on `work_days`.`id` = `employee_work_day`.`work_day_id` where `employee_work_day`.`employee_id` in (14) and `work_days`.`deleted_at` is null
select sum(`total`) as aggregate from `overtimes` where `employee_id` = 3014 and `overtimes`.`deleted_at` is null
---
    public function detail($id){
        $employee = Employee::with('job_title', 'position', 'workDay', 'kpis')->findOrFail($id);

        $startDate = new DateTime($employee->joining_date);
        $currentDate = new DateTime();
        $interval = $startDate->diff($currentDate);

        $years = $interval->y;
        $months = $interval->m;
        $days = $interval->d;

        $totalOvertime = Overtime::where('employee_id', $employee->eid)
        ->sum('total');