app/Http/Controllers/HomeController.php

    public function index()
    {

        $employeeStatus = EmployeeStatus::orderBy('name', 'asc')->pluck('name')->toArray();
---
select `name` from `employee_status` where `employee_status`.`deleted_at` is null order by `name` asc