app/Http/Controllers/KpiController.php

    public function addKpi(Request $request){
        $userDivision = Auth::user()->division_id;
        $userDepartment = Auth::user()->department_id;
        $query = Employee::query();
        if ($userDivision && !$userDepartment) {
            $query->where('division_id', $userDivision);
        } elseif (!$userDivision && $userDepartment) {
            $query->where('department_id', $userDepartment);
        }

        $employees = $query->get();
---
select * from `employees` where `employees`.`id` in (3) and `employees`.`deleted_at` is null

    public function create(Request $request){
        $request->validate([
            'employee' => 'required',
            'month' => 'required',
            'year' => 'required',
            'grades.*' => 'required'
        ]);

        $employee_id = $request->employee;
        $employee = Employee::where('id', $employee_id)->first();
        $employee_name = $employee->name;
        $month = $request->month;
        $year = $request->year;

        $existingKpi = GradeKpi::where('employee_id', $employee_id)
                       ->where('month', $month)
                       ->where('year', $year)
                       ->first();

        if($existingKpi) {
            return back()->with('error', 'Kpi ' . $employee_name . ' pada ' . $month . ' ' . $year . ' sudah ada.');
        }

        foreach ($request->input('grades') as $kpi_id => $inputGrade) {

            $indicators = PerformanceKpi::find($kpi_id);
---
select * from `employees` where `id` = '3' and `employees`.`deleted_at` is null limit 1
select * from `grade_kpis` where `employee_id` = '3' and `month` = 'February' and `year` = '2024' and `grade_kpis`.`deleted_at` is null limit 1
select * from `performance_kpis` where `performance_kpis`.`id` = 62 and `performance_kpis`.`deleted_at` is null limit 1

            $gradeKpi->indicator_id = $kpi_id;
            $gradeKpi->achievement = $inputGrade;
            $gradeKpi->grade = $grade;
            $gradeKpi->save();
---
insert into `grade_kpis` (`employee_id`, `month`, `year`, `indicator_id`, `achievement`, `grade`, `updated_at`, `created_at`) values ('3', 'February', '2024', 62, '33333333', '2.00', '2025-01-03 15:06:14', '2025-01-03 15:06:14')

    public function getKpiByEmployee($kpiId){
        $kpis = PerformanceKpi::where('kpi_id', $kpiId)->get();
---
select * from `performance_kpis` where `kpi_id` = '17' and `performance_kpis`.`deleted_at` is null

    public function detail($employee_id, $month = null, $year = null){
        $employees = Employee::findOrFail($employee_id);
        $indicators = PerformanceKpi::get();
        $query = GradeKpi::where('employee_id', $employee_id);

        if ($month) {
            $query->where('month', $month);
        }
        if ($year) {
            $query->where('year', $year);
        }
        $gradeKpi = $query->get();
---
select * from `employees` where `employees`.`id` = '3' and `employees`.`deleted_at` is null limit 1
select * from `performance_kpis` where `performance_kpis`.`deleted_at` is null
select * from `grade_kpis` where `employee_id` = '3' and `month` = 'January' and `year` = '2024' and `grade_kpis`.`deleted_at` is null

    public function edit($employee_id, $month = null, $year = null){
        $employees = Employee::with('position')->findOrFail($employee_id);
        $query = GradeKpi::where('employee_id', $employee_id);
        if ($month) {
            $query->where('month', $month);
        }
        if ($year) {
            $query->where('year', $year);
        }
        $gradeKpi = $query->get();
---
select * from `employees` where `employees`.`id` = '3' and `employees`.`deleted_at` is null limit 1
select * from `positions` where `positions`.`id` in (6) and `positions`.`deleted_at` is null
select * from `grade_kpis` where `employee_id` = '3' and `month` = 'January' and `year` = '2025' and `grade_kpis`.`deleted_at` is null

    public function update(Request $request, $employee_id, $month, $year){
        foreach ($request->input('grades') as $kpi_id => $inputGrade) {
            $indicators = PerformanceKpi::find($kpi_id);

            if ($indicators) {
                $target = $indicators->target;
                $bobot = $indicators->bobot;
                $grade = ($inputGrade / $target) * $bobot;
                $grade = min($grade, $bobot);
                $grade = number_format($grade, 2);

                $gradeKpi = GradeKpi::where('employee_id', $request->employee_id)
                    ->where('month', $request->month)
                    ->where('year', $request->year)
                    ->where('indicator_id', $indicators->id)
                    ->first();

                if ($gradeKpi) {
                    $gradeKpi->achievement = $inputGrade;
                    $gradeKpi->grade = $grade;
                    $gradeKpi->save();
---
select * from `performance_kpis` where `performance_kpis`.`id` = 62 and `performance_kpis`.`deleted_at` is null limit 1
select * from `grade_kpis` where `employee_id` = '3' and `month` = 'February' and `year` = '2024' and `indicator_id` = 62 and `grade_kpis`.`deleted_at` is null limit 1
update `grade_kpis` set `achievement` = '12423', `grade_kpis`.`updated_at` = '2025-01-03 15:17:40' where `id` = 41