app/Http/Controllers/KpiController.php

select * from `employees` where `employees`.`id` in (3) and `employees`.`deleted_at` is null
---
public function detail($id)
{
    $kpi = PerformanceKpiResult::with('employees', 'details')->findOrFail($id);
    $employee = Employee::findOrFail($kpi->employee_id);