app/Http/Controllers/KpiPaOptionsController.php

select * from `positions` where `positions`.`deleted_at` is null
select `kpi_id` from `performance_kpis` where `performance_kpis`.`deleted_at` is null group by `kpi_id`
select `appraisal_id` from `performance_appraisals` where `performance_appraisals`.`deleted_at` is null group by `appraisal_id`
select * from `performance_appraisal_name` where `performance_appraisal_name`.`deleted_at` is null
---
    function index(){
        $positions = Position::get();
        $indicators = PerformanceKpi::select('kpi_id')->groupBy('kpi_id')->get();
        $kpi_id = KpiAspect::with('kpis')->get();
        $appraisals = PerformanceAppraisal::select('appraisal_id')->groupBy('appraisal_id')->get();
        $appraisal_id = AppraisalName::get();

select * from `performance_kpis` where `kpi_id` = '23' and `performance_kpis`.`deleted_at` is null
---
public function indicatorDetail($kpi_id)
{
    // $kpi_aspect = KpiAspect::with('kpis')->get();
    $indicators = PerformanceKpi::where('kpi_id', $kpi_id)->get();