app/Http/Controllers/LeaveController.php

    public function index (Request $request) {
        $query = Leave::query();
        $today = now();
        $defaultStartDate = $today->copy()->startOfMonth()->toDateString();
        $defaultEndDate = $today->toDateString();
        $startDate = $request->input('start_date', $defaultStartDate);
        $endDate = $request->input('end_date', $defaultEndDate);
        $userDivision = Auth::user()->division_id;
        $userDepartment = Auth::user()->department_id;

        // Filter by division and/or department if set
        if ($userDivision && !$userDepartment) {
            $query->whereHas('employees', function ($query) use ($userDivision) {
                $query->where('division_id', $userDivision);
            });
        } elseif (!$userDivision && $userDepartment) {
            $query->whereHas('employees', function ($query) use ($userDepartment) {
                $query->where('department_id', $userDepartment);
            });
        } elseif ($userDivision && $userDepartment) {
            $query->whereHas('employees', function ($query) use ($userDivision, $userDepartment) {
                $query->where('division_id', $userDivision)
                      ->where('department_id', $userDepartment);
            });
        }

        if ($startDate && $endDate) {
            $query->whereBetween('created_at', [$startDate, $endDate]);
        }

        $leaves = $query->with('employees')->get();

        $employees = Employee::whereNull('resignation')->get();
---
select * from `employees` where `employees`.`id` in (2) and `employees`.`deleted_at` is null
select * from `leaves` where `created_at` between '2024-12-25 00:00:00' and '2025-01-03 23:59:59' and `leaves`.`deleted_at` is null
select * from `employees` where `resignation` is null and `employees`.`deleted_at` is null

    public function store (Request $request) {
        $id = $request->id;
        $employeeId = $request->input('employee_id');
        $leaveDates = $request->input('leave_dates');
        $leaveDates = explode(',', $leaveDates[0]);
        $leaveDates = array_map('trim', $leaveDates);
        $category = $request->input('category');
        $note = $request->input('note');
        $action = $request->input('action');
        $status = ($action === 'accept') ? 1 : (($action === 'reject') ? 2 : 0);

        $employee_name = Employee::where('id', $employeeId)->first();
---
select * from `employees` where `employees`.`id` in (5) and `employees`.`deleted_at` is null