app/Http/Controllers/OvertimeController.php

    function index(Request $request){
        $query = Overtime::with('employees');
        $startDate = $request->input('start_date');
        $endDate = $request->input('end_date');
        $userDivision = Auth::user()->division_id;
        $userDepartment = Auth::user()->department_id;

        if ($userDivision && !$userDepartment) {
            $query->whereHas('employees', function ($query) use ($userDivision) {
                $query->where('division_id', $userDivision);
            });
        } elseif (!$userDivision && $userDepartment) {
            $query->whereHas('employees', function ($query) use ($userDepartment) {
                $query->where('department_id', $userDepartment);
            });
        } elseif ($userDivision && $userDepartment) {
            $query->whereHas('employees', function ($query) use ($userDivision, $userDepartment) {
                $query->where('division_id', $userDivision)
                      ->where('department_id', $userDepartment);
            });
        }

        if ($startDate && $endDate) {
            $query->whereBetween('date', [$startDate, $endDate]);
        }
        $overtimes = $query->get();
        $employees = Employee::get();
---
select * from `employees` where `employees`.`id` in (1, 149)
select * from `overtimes`
select * from `employees`

    function update(Request $request, $id){
        $overtime = Overtime::findOrFail($id);
        $request->validate([
            'name'=>'string',
            'date'=>'date',
        ]);

        // Parse start and end times using Carbon
        $start = Carbon::createFromFormat('H:i:s', $request->start);
        $end = Carbon::createFromFormat('H:i:s', $request->end);

        //If end time is before start time
        if($end->lt($start)){
            $end->addDay();
        }

        // Calculate the difference in minutes
        $totalMinutes = $start->diffInMinutes($end);
        $employee = Employee::where('name', $request->name)->first();
---
select * from `overtimes` where `overtimes`.`id` = '10' limit 1
select * from `employees` where `name` is null limit 1