app/Http/Controllers/PresenceController.php

public function index(Request $request){
    $query = Presence::with('employee');
    $startDate = $request->input('start_date');
    $endDate = $request->input('end_date');
    $userDivision = Auth::user()->division_id;
    $userDepartment = Auth::user()->department_id;

    if ($userDivision && !$userDepartment) {
        $query->whereHas('employee', function ($query) use ($userDivision) {
            $query->where('division_id', $userDivision);
        });
    } elseif (!$userDivision && $userDepartment) {
        $query->whereHas('employee', function ($query) use ($userDepartment) {
            $query->where('department_id', $userDepartment);
        });
    } elseif ($userDivision && $userDepartment) {
        $query->whereHas('employee', function ($query) use ($userDivision, $userDepartment) {
            $query->where('division_id', $userDivision)
                  ->where('department_id', $userDepartment);
        });
    }

    if ($startDate && $endDate) {
        $query->whereBetween('date', [$startDate, $endDate]);
    }

    $presence = $query->get();
---
select * from `employees` where `employees`.`id` in (1)
select * from `presences` where exists (select * from `employees` where `presences`.`employee_id` = `employees`.`id` and `division_id` = 7)


    // $workDay = Employee::with('workDay')->get()->keyBy('id');

    $employees = Employee::all();
    $workDays = [];
    foreach ($employees as $employee) {
        // Ambil semua work days untuk masing-masing employee
        $workDay[$employee->id] = $employee->workDay->map(function ($workDay) {
            return [
                'id' => $workDay->id,
                'name' => $workDay->name,
            ];
        });
---
select * from `employees`
select MIN(id) as id, `name` from `work_days` group by `name`
select `work_days`.*, `employee_work_day`.`employee_id` as `pivot_employee_id`, `employee_work_day`.`work_day_id` as `pivot_work_day_id` from `work_days` inner join `employee_work_day` on `work_days`.`id` = `employee_work_day`.`work_day_id` where `employee_work_day`.`employee_id` = 1 and `work_days`.`deleted_at` is null

    public function create(Request $request){
        $employee_id = $request->employee_id;
        $employee = Employee::where('id', $employee_id)->first();
        $eid = $employee->eid;
        $employee_name = $employee->name;
        $date = Carbon::parse($request->date);
        $today = strtolower($date->format('l'));
        $workDayId = $request->workDay;
        $workDay = WorkDay::where('name', $workDayId)->where('day', $today)->first();
---
select * from `employees` where `id` = '14' limit 1
select * from `work_days` where `name` is null and `day` = 'friday' limit 1