app/Http/Controllers/PresenceController.php

public function indexOlod(){
    $employees = Employee::whereNull('resignation')->get();
            $workDays = $employees->mapWithKeys(fn($e) => [
            $e->id => $e->workDay->map(fn($wd) => [
                'id' => $wd->id,
                'name' => $wd->name
            ])
        ])->toArray();
---
select * from `employees` where `resignation` is null and `employees`.`deleted_at` is null
select MIN(id) as id, `name` from `work_days` group by `name`