app/Http/Controllers/PresenceSummaryController.php

select * from `employees` where `employees`.`deleted_at` is null
select `work_days`.*, `employee_work_day`.`employee_id` as `pivot_employee_id`, `employee_work_day`.`work_day_id` as `pivot_work_day_id` from `work_days` inner join `employee_work_day` on `work_days`.`id` = `employee_work_day`.`work_day_id` where `employee_work_day`.`employee_id` in (1, 2, 3, 5, 7, 8, 10, 11, 12, 14, 16, 17, 18, 19, 20, 21, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 38, 39, 40, 44, 45, 50, 51, 60, 66, 70, 72, 74, 75, 76, 77, 78, 80, 83, 90, 103, 106, 107, 108, 109, 110, 111, 112, 117, 118, 120, 122, 125, 126, 129, 133, 134, 135, 136, 137, 138, 139, 143, 144, 147, 149, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170) and `work_days`.`deleted_at` is null
select * from `employees` where `resignation` is null and `employees`.`deleted_at` is null
---
    function index(Request $request){
        $today = now();
        $defaultStartDate = $today->copy()->startOfMonth()->toDateString();
        $defaultEndDate = $today->toDateString();
        $startDate = $request->input('start_date', $defaultStartDate);
        $endDate = $request->input('end_date', $defaultEndDate);
        $userDivision = Auth::user()->division_id;
        $userDepartment = Auth::user()->department_id;

        //Get Employee
        $query = Employee::query()
                 ->with('overtimes', 'presences', 'WorkDay')
                 ->whereNull('resignation')
                 ->get();

        // $query = Employee::with('overtimes', 'presences', 'WorkDay')->get();
        // $query = Employee::query();
        if ($userDivision && !$userDepartment) {
            $query->where('division_id', $userDivision);
        } elseif (!$userDivision && $userDepartment) {
            $query->where('department_id', $userDepartment);
        }

        $employees = $query->get();

select `work_days`.*, `employee_work_day`.`employee_id` as `pivot_employee_id`, `employee_work_day`.`work_day_id` as `pivot_work_day_id` from `work_days` inner join `employee_work_day` on `work_days`.`id` = `employee_work_day`.`work_day_id` where `employee_work_day`.`employee_id` = 2 and `work_days`.`deleted_at` is null
select `day` from `work_days` where `name` = 'Berlaku' and `day_off` = 1 and `work_days`.`deleted_at` is null
---
        $totalDays = intval($countStartDate->diffInDays($countEndDate) + 1);

        $wd = $employee->workDay;
        $wdName = $wd->pluck('name')->first();
        $dayOff = WorkDay::where('name', $wdName)->where('day_off', 1)->pluck('day');

select count(`date`) as aggregate from `presences` where `employee_id` = 2 and `date` between '2025-01-01 00:00:00' and '2025-01-02 00:00:00' and `presences`.`deleted_at` is null
---

        $effectiveDays = $totalDays - $dayOffCount;

        $employee->presence = Presence::where('employee_id', $employee->id)
            ->whereBetween('date', [$countStartDate, $countEndDate])
            ->count('date'); //Total Presence

select count(*) as aggregate from `leaves` where `employee_id` = 2 and `date` between '2025-01-01' and '2025-01-02' and `category` = 'Annual leave' and `status` = 1 and `leaves`.`deleted_at` is null
---
            if($startDate && $endDate) {
                $annual_leave->whereBetween('date', [$startDate, $endDate]);
            }
            $employee->annual_leave = $annual_leave->where('category', $annualLeave)->where('status', 1)->count();

select count(*) as aggregate from `leaves` where `employee_id` = 2 and `status` = '1' and `date` between '2025-01-01' and '2025-01-02' and `category` = 'Sick' and `status` = 1 and `leaves`.`deleted_at` is null
---
            if($startDate && $endDate) {
                $sick_leave->whereBetween('date', [$startDate, $endDate]);
            }
            $employee->sick_leave = $sick_leave->where('category', $sickLeave)->where('status', 1)->count();

select count(*) as aggregate from `leaves` where `employee_id` = 2 and `date` between '2025-01-01' and '2025-01-02' and `category` = 'Permit' and `status` = 1 and `leaves`.`deleted_at` is null
---
            if($startDate && $endDate) {
                $permit_leave->whereBetween('date', [$startDate, $endDate]);
            }
            $employee->permit_leave = $permit_leave->where('category', $permitLeave)->where('status', 1)->count();