app/Http/Controllers/ResignationController.php

select * from `employees` where `employees`.`deleted_at` is null
select * from `employees` where `resignation_date` is not null and `employees`.`deleted_at` is null
---
    public function index() {
        $employees = Employee::get();
        $resignEmployees = Employee::whereNotNull('resignation_date')->get();

select * from `employees` where `id` = '38' and `employees`.`deleted_at` is null limit 1
update `employees` set `resignation` = 'Mengundurkan Diri', `resignation_date` = '2024-11-28', `employees`.`updated_at` = '2024-12-04 14:06:23' where `id` = 38
---
    public function store(Request $request) {
        $request->validate([
            'name' => 'required',
            'category' => 'required',
            'date' => 'required'
        ]);

        $employee = Employee::where('id', $request->name)->first();
        if($employee && $employee->resignation_date !== null) {
            return response()->json([
                'success' => false,
                'message' => 'This employee has already resigned and cannot be added.'
            ]);
        }

        $employee->update([
            'resignation'=> $request->category,
            'resignation_date' => $request->date
        ]);

select * from `employees` where `employees`.`id` = '1' limit 1
---
    public function update(Request $request) {
        $request->validate([
            'name' => 'required|exists:employees,id',
            'category' => 'required',
            'date' => 'required'
        ]);

        $employee = Employee::find($request->name);

select * from `employees` where `employees`.`id` = '1' and `employees`.`deleted_at` is null limit 1
update `employees` set `resignation` = null, `resignation_date` = null, `employees`.`updated_at` = '2025-01-02 10:56:20' where `id` = 1
---
    public function delete($id) {
        $employee = Employee::find($id);
        $employee->update([
            'resignation' => null,
            'resignation_date' => null
        ]);