app/Http/Controllers/RoleController.php

select * from `roles` where `roles`.`id` = '1' limit 1
select * from `permissions` order by `group_name` asc, `name` asc
---
    public function detail ($id) {
        {
            $role = Role::findOrFail($id);
            $permissions = Permission::orderBy('group_name', 'asc')->orderBy('name', 'asc')->get();

select * from `roles` where `roles`.`id` = '1' limit 1
select * from `permissions` order by `group_name` asc, `name` asc
---
public function edit ($id) {
    $role = Role::findOrFail($id);
    $permissions = Permission::orderBy('group_name', 'asc')->orderBy('name', 'asc')->get();