app/Http/Controllers/SalesController.php

    function index(Request $request){
        $employees = Employee::where('sales_status', '1')->get();
        $sales = Sales::with('employees')
            ->select('month', 'year', DB::raw('SUM(qty) as Qty'))
            ->groupBy('month', 'year')
            ->get();

        $month = $request->month;

        $selectedMonth = $request->input('month', date('F'));
        $selectedYear = $request->input('year', date('Y'));

        $salesData = Sales::select('month', DB::raw('SUM(qty) as total_qty'))
        ->groupBy('month')
        ->get();
---
select * from `employees` where `sales_status` = '1' and `employees`.`deleted_at` is null
select `month`, `year`, SUM(qty) as Qty from `sales` where `sales`.`deleted_at` is null group by `month`, `year`
select `month`, SUM(qty) as total_qty from `sales` where `sales`.`deleted_at` is null group by `month`