app/Http/Controllers/UserController.php

    public function index() {
        $users = User::with('roles')->get();
        $roles = Role::all();
        $divisions = Division::all();
        $departments = Department::all();
---
select * from `users` where `users`.`deleted_at` is null
select * from `roles` where `roles`.`deleted_at` is null
select * from `divisions` where `divisions`.`deleted_at` is null
select * from `departments` where `departments`.`deleted_at` is null

    public function update(Request $request, $id) {
        // Validate the request
        $request->validate([
            'name' => 'required|string|max:20',
            'username' => 'required|string|regex:/^[a-z]+$/|unique:users,username,' . $id, // Ignore current username in validation
            'email' => 'required|email|unique:users,email,' . $id, // Ignore current email in validation
            'password' => 'nullable|string|min:8', // Password is optional on update
            'role_id' => 'required|exists:roles,id', // Ensure a valid role is selected
        ]);

        // Find the user
        $user = User::findOrFail($id);
---
select * from `users` where `users`.`id` = '1' limit 1