app/Http/Controllers/WorkDayController.php

    public function index(){
        $workDays = WorkDay::select('name')->groupBy('name')->get();
---
select `name` from `work_days` where `work_days`.`deleted_at` is null group by `name`